Repository: giellalt/corpus-nob
Catalog: prestable/tmx/sme/facta/skuvlahistorja6/elisabeth-n.html.tmx
Source language: nob
Languages: sme

source: Desentralisert utdanning i Kåfjord
sme: Lávdaduvvon oahppu Gáivuonas

source: Fortalt til Siri Broch Johansen
sme: Muitalan Siri Broch Johansenii

source: Etter lærerutdanning ved Samisk høgskole fikk Elisabeth Johansen arbeid som samisklærer ved Nordreisa videregående skole.
sme: Sámi allaskuvlla oahpaheaddjioahpu maŋŋá oaččui Elisabeth Johansen barggu Ráissa joatkkaskuvlla sámegieloahpaheaddjin.

source: (Foto utlånt av Elisabeth Johansen)
sme: (Govva luoikan Elisabeth Johansen)

source: Elisabeth Johansen er født i 1977 og oppvokst i Manndalen i Kåfjord i Nord-Troms.
sme: Elisabeth Johansen lea riegádan 1977:s ja lea bajásšaddan Olmmáivákkis Gáivuonas Davvi-Romssas.

source: Hun har gått grunnskolen i Manndalen, videregående skole i Nordreisa og ett år på Den Samiske Folkehøgskolen i Karasjok, friluftslivlinja.
sme: Son lea vázzán Olmmáivákki vuođđoskuvlla, Ráissa joatkkaskuvlla ja jagi Sámi álbmotallaskuvlla meahcástansuorggis Kárášjogas.

source: Hun har allmennlærerutdanning ved Samisk høgskole.
sme: Sus lea dábálašoahpaheaddjioahppu Sámi allaskuvllas.

source: Hun jobber som samisklærer ved Nord-Troms videregående skole i Nordreisa.
sme: Son bargá sámegieloahpaheaddjin Davvi-Romssa joatkkaskuvllas Ráissas.

source: Det er utdanninga hennes ved Samisk høgskole denne artikkelen skal handle om. Intervjuet er gjort i februar 2012.
sme: Dát artihkal máinnaša dan oahppu maid gaccai Sámi allaskuvllas. Leat jearahallan Elisabetha 2012 guovvamánus.

source: Jeg begynte på utdanninga som Samisk høgskole hadde i Manndalen høsten 1997.
sme: Álgen Sámi allaskuvlla lávdaduvvon ohppui Olmmáivákkis 1997 čavčča.

source: Jeg tok samisk semesteremne og første del av samisk grunnfag det første året.
sme: Dien lohkanjagi válden sámegiela lohkanbadjeoahpu ja sámegiela vuođđofága vuosttaš oasi.

source: Jeg fikk godkjent semesteremnet som valgfag i lærerutdanninga.
sme: Lohkanbadjeoahppu dohkkehuvvui oahpaheaddjioahpu oassin válljenfágan.

source: Etter det første året dro jeg til Kautokeino og tok resten av lærerutdanninga der.
sme: Vuosttaš jagi maŋŋá vulgen Guovdageidnui, ja de jotken oahpaheaddjioahpu doppe.

source: I løpet av de tre årene i Kautokeino tok jeg fullt grunnfag i samisk.
sme: Dan golmma jagis maid Guovdageainnus ledjen, lohken maid olles vuođđofága sámegielas.

source: Straks jeg var ferdig i Kautokeino, begynte jeg som samisklærer her på Nordreisa videregående.
sme: Dakkaviđe go Guovdageainnus gergen, de álgen sámegieloahpaheaddjin deike Ráissa joatkkaskuvlii.

source: Og her har jeg vært siden.
sme: Ja dáppe lean ain bargamin.

source: Jeg har hele tida tatt mer utdanning.
sme: Lean ollesáigge váldán lasi oahpu.

source: Til nå har jeg tatt Musikk i skolen 1 og 2, Samisk kulturkunnskap, Nettbasert undervisningsopplegg, ex.phil og ex.fac. og ytterligere 30 studiepoeng samisk, så nå har jeg fått bachelorgraden.
sme: Dán rádjái lean váldán Musihkka skuvllas 1 ja 2, Sámi kulturmáhtu, Interneahta bokte oahpahit, ex.phil. ja ex.fac. ja de velá 30 lohkančuoggá sámegielas, nu ahte dál lean ožžon bachelorgráda.

source: Jeg underviser i musikk en time i uka på spesialavdelinga.
sme: Oahpahan musihka ovtta tiimmu vahkus heivehuvvon oahpu ossodagas.

source: Ellers underviser jeg bare i samisk.
sme: Muđui oahpahan dušše sámegiela.

source: I år har jeg både klasser her på skolen og fjernundervisning til Tromsdalen, Nordkjosbotn og Breivang videregående skoler.
sme: Dán jagi leat mus luohkát sihke dán skuvllas, ja gáiddusoahppoluohkát Sálašvákki, Boallovuona ja Breivang joatkkaskuvllain.

source: Jeg har også en elev i Ål i Hallingdal.
sme: Mus lea maid oahppi Ålas Hallingdálas.

source: Det var absolutt ikke en selvfølge at jeg skulle bli samisklærer.
sme: Ii lean mangeláhkái diehttelas ahte galgen šaddat sámegieloahpaheaddjin.

source: Jeg har jo hørt samisk i oppveksten, og jeg hadde litt lyst til å lære meg språket.
sme: Lean gal sámegiela gullan bajásšaddadettiin, ja mus lei binnáš hállu giela oahppat.

source: Så da jeg kom hit til Nordreisa på videregående, tok jeg samisk C-språk.
sme: Ja go de bohten deike Ráissa joatkkaskuvlii, de válden sámegiela C-giellan.

source: Og det kan jeg si, jeg var ingen sekser-kandidat!
sme: Ja dan gal oaččut diehtit, in lean makkárge guđeš-kandidáhta!

source: Jeg lærte en del grammatikk og skriving på videregående, men jeg kunne ikke snakke eller skrive samisk da jeg gikk ut derfra.
sme: Ohppen muhtun muddui giellaoahpa ja čállima joatkkaskuvllas, muhto in máhttán sárdnut dahje čállit sámegiela go gergen doppe.

source: Det første året etter videregående gikk jeg på den samiske folkehøgskolen i Karasjok.
sme: Vuosttaš jagi joatkkaskuvlla maŋŋil vázzen sámi álbmotallaskuvlla Kárášjogas.

source: Og da dette studiet dukket opp i Manndalen året etter, fant jeg ut at det var høvelig å bli med på det.
sme: Ja go de dát lohkanvejolašvuohta iđii Olmmáivákkis jagi maŋŋil, de gávnnahin ahte livččii vuogas searvat.

source: Jeg ville lære meg språket, og jeg så at dette var en måte jeg kunne gjøre det på.
sme: Áigon giela oahppat, ja oidnen dán vuohkin áigumušaidan duohtandahkat.

source: Det at vi fikk ta semesteremne først, ga et godt grunnlag for videre studier.
sme: Go beasaimet lohkanbadjeoahpuin álgit, fidniimet buori vuođu viidásut lohkamiidda.

source: Sommeren før selve studiet startet, gikk vi på språkbad på språksenteret i Manndalen.
sme: Geasi ovdal go allaskuvlla oahppu álggii, vácciimet giellalávguma giellaguovddážis Olmmáivákkis.

source: Da jeg starta der kunne jeg egentlig bare presentere meg sjøl på samisk, det var ikke så mye mer.
sme: Go dohko álgen, de in máhttán olus eanet go iežan presenteret sámegillii.

source: Sommeren 1997 arrangerte Samisk språksenter i Kåfjord et forkurs i Manndalen.
sme: 1997 geasi lágiidii Gáivuona sámi giellaguovddáš ovdakurssa Olmmáivákkis.

source: Her er det pause fra skjæring av sennagrass.
sme: Dat attii vuođu álgit lohkanbadjeohppui čakčat.

source: Fra venstre: Øystein Steinlien, Klemet Anders Sara, Inger Marie Åsli, Roald Gundersen, Elisabeth Johansen, Oliva Nilsen og Anna Salo.
sme: Gurut bealde: Øystein Steinlien, Klemet Anders Sara, Inger Marie Åsli, Roald Gundersen, Elisabeth Johansen, Oliva Nilsen og Anna Salo.

source: Forkurs semesteremne i Kåfjord på studietur til Karesuando.
sme: Lohkanbadjeoahpu ovdakurssa Gárasavvon-mátkkis.

source: Fra venstre: Idar Pedersen, Inger Marie Åsli, Elisabeth Johansen, Ruth Larsen, Ingrid Johansen og Edel Monsen.
sme: Gurut bealde: Idar Pedersen, Inger Marie Åsli, Elisabeth Johansen, Ruth Larsen, Ingrid Johansen, Edel Monsen.

source: Jeg lærte veldig mye både på semesteremnet og første del av grunnfaget, som jeg tok i Manndalen.
sme: Ohppen hui olu sihke lohkanbadjeoahpus ja vuođđofága vuosttaš oasis, maid válden Olmmáivákkis.

source: Men jeg begynte ikke å prate samisk da.
sme: Muhto in álgán dalle sámástit.

source: Sommeren før jeg begynte på det siste året i Kautokeino, altså sommeren 2000, jobba jeg på språksenteret i Manndalen.
sme: Geasi ovdal go álgen maŋimuš skuvlajagi lohkat Guovdageainnus, namalassii 2000 geasi, bargen giellaguovddážis Olmmáivákkis.

source: Da tvang jeg meg sjøl til å snakke samisk på jobb.
sme: Dalle bággejin iežan sámástit barggus.

source: Jeg snakka også samisk hjemme med mamma og pappa, så den sommeren kom jeg skikkelig i gang med pratinga.
sme: Sámástin maid siiddas etniin ja áhčiin, nu ahte dien geasi bohten bures johtui sámástit.

source: Da jeg kom tilbake til Kautokeino for å starte på det siste studieåret, fortsatte jeg å snakke samisk.
sme: Go de fas máhccen Guovdageidnui maŋimuš skuvlajahkái, de jotken sámástit.

source: Folk der oppe var vant til å snakke norsk til meg.
sme: Olbmot doppe ledje hárjánan dárostit munnje.

source: Jeg fant ut at hvis jeg ikke skulle begynne å snakke samisk det siste studieåret, så kom det vel aldri til å bli.
sme: Gávnnahin ahte jus in sámástišgoahtán maŋimuš lohkanjagi, de in šattaše goassige dan dahkat.

source: Så da begynte jeg å snakke samisk til dem. De snakka norsk til meg, for det var de vant til.
sme: Ja de álgen sámástit sidjiide. Sii ges dárostedje munnje, go ledje hárjánan dasa.

source: Jeg svarte på samisk helt til de ga seg og begynte å snakke samisk med meg.
sme: Mun de vástidin sámegillii dassážii go vuollánedje ja álge muinna sámástit.

source: På det året lærte jeg utrolig mye.
sme: Ohppen hirbmat olu dien jagi.

source: Men i alle praksisperiodene på lærerskolen snakket jeg samisk, helt fra begynnelsen av.
sme: Muhto sámástin álggu rájes buot oahpaheaddjioahpu hárjehallanáigodagain.

source: Jeg husker vi var i Karasjok det første året.
sme: Muittán go leimmet Kárášjogas vuosttaš jagi.

source: Jeg tror vi hadde to timer praksis.
sme: Orun muitimin ahte mis ledje guokte tiimmu hárjehallan.

source: De andre studentene hadde bare noen stikkord på et ark, så var de klare.
sme: Iežá studeanttat ledje dušše čálistan moadde sáni báberbihtážii, de ledje gergosat.

source: Men jeg satt i timesvis og planla det vi skulle gjøre.
sme: Muhto mun golahin diibmoviissaid plánet oahpahusa.

source: Jeg satt med ordboka og leita fram på forhånd de ordene jeg trodde jeg kunne få bruk for.
sme: Čohkkájin sátnegirjjiin, ohcen ovddalgihtii daid sániid maid jáhkken ahte várra dárbbašivččen.

source: Det var sinnssykt mye arbeid før disse praksistimene!
sme: Lei jáhkkemeahttun olu bargu ovdal dáid hárjehallantiimmuid!

source: Men jeg var fast bestemt på å ikke snakke norsk i disse timene.
sme: Muhto ledjen hui garas dasa ahte in galgan dárostit dáin diimmuin.

source: Vi hadde et to-lærersystem, så jeg hadde noen medstudenter i bakhånd som kunne hjelpe meg hvis jeg ikke fant ut hvordan jeg skulle forklare tingene på samisk.
sme: Lei guokte-oahpaheaddjivuogádat, ahte ledje gal álo mielstudeanttat mielde geat sáhtáše mu veahkehit jus in máhttán gait čilget sámegillii.

source: Jeg brukte dem aldri, men det var en trygghet å ha dem der.
sme: In goassege dárbbašan sin veahki, muhto dovden oadjebasvuođa das, ahte ledje doppe.

source: Å følge med på forelesningene kunne også være en utfordring.
sme: Sáhtii maid leat hástalus logaldallamiid čuovvulit.

source: Jeg husker spesielt matematikkforelesningene.
sme: Muittán erenoamážit matematihkkalogaldallamiid.

source: Samisken min var jo ganske fersk, og mattelæreren var fra finsk side.
sme: Mu sámegiella lei viehka varas, ja matematihkkaoahpaheaddji bođii suoma bealde.

source: Det var ganske krevende å forstå samisken hans, det må jeg si.
sme: Lei viehka hástalus ipmirdit su sámegiela.

source: Men jeg hadde jo mattebøkene fra videregående, og stoffet var ikke helt ukjent i og for seg.
sme: Muhto mus ledje gal joatkkaskuvlla matematihkkagirjjit, eai lean iešalddis amas matematihkkafáttát.

source: De andre i klassen kunne også hjelpe meg, de kunne forklare hva læreren sa hvis jeg ikke forsto.
sme: Mielstudeanttat sáhtte maid veahkehit mu, sáhtte čilget maid oahpaheaddji dajai, jus in ipmirdan.

source: I andre fag var egentlig ikke språket en stor hemsko.
sme: Ii lean gal giella stuorra váttisvuohtan iežá fágain.

source: Skolen så ikke på språket i og for seg, men på hva jeg gjorde rent faglig.
sme: Ii skuvla geahččan giela sierra, muhto mu fágalaš bargguid.

source: I duodji, for eksempel, så de på det jeg gjorde.
sme: Ovdamearkka dihte duodjefágas gehčče mu bargguid.

source: Målet mitt var å stå i alle fag.
sme: Mu mihttomearri lei buot fágaid ceavzit.

source: Undervisningen var jo på samisk, så jeg hadde en del ekstrajobb.
sme: Lei gal mus liigebargu go oahpahus lei sámegillii.

source: Men jeg fant fort ut at jeg rent faglig sett stilte på lik linje med de andre, så fagene i seg sjøl var ikke vanskeligere for meg enn for de andre.
sme: Muhto ipmirdin jođánit ahte ledjen fágalaččat seammá dásis go earát. Nu ahte fágat eai lean gal váddát munnje go iežá studeanttaide.

source: Angra aldri på valget
sme: In leat goassige gáhtan

source: Jeg angra aldri på at jeg valgte Samisk høgskole.
sme: In leat goassege gáhtan ahte válljejin Sámi allaskuvlla.

source: Jeg gikk ikke rundt og tenkte på at jeg heller kunne ha gått i Alta eller Tromsø.
sme: In leat smiehtadan ahte galggašin baicce vázzit Álttás dahje Romssas.

source: Jeg trivdes i Kautokeino.
sme: Mun lokten áiggi Guovdageainnus.

source: Da jeg gikk ut fra Kautokeino, hadde jeg lært meg samisk ganske godt.
sme: Go gergen doppe, ledjen oahppan sámegiela viehka bures.

source: Da var det ikke annet å gjøre enn å bli samisklærer.
sme: Dalle ii lean iežá go šaddat sámegieloahpaheaddji.

source: Jeg liker best å undervise i samisk som fremmedspråk eller andrespråk.
sme: Liikon buoremusat oahpahit sámegiela amasgiellan dahje nubbingiellan.

source: Det er fremmedspråksdidaktikken jeg føler meg mest komfortabel med. Jeg ønsker helst ikke å undervise i samisk som morsmål eller på samisk i andre fag.
sme: Dovddan ahte amasgielladidaktihkka dat heive buoremusat munnje. In nu hálit oahpahit sámegiela eatnigiellan dahje oahpahit iežá fágaid sámegillii.

source: Med den bakgrunnen jeg har tror jeg at jeg kan være en god fremmedspråkslærer.
sme: Jáhkán ahte dáinna duogážiin mii mus lea, de sáhtán leat buorre amasgieloahpaheaddjin.

source: Jeg bruker de metodene som var nyttige for meg.
sme: Anán ieš daid vugiid mat leat leamaš mávssolaččat munnje.

source: Som førstespråkslærer må man ha et mye større ordforråd, jeg føler at det er fremmedspråkslærer jeg er.
sme: Dovddan ahte lean amasgiellaoahpaheaddji, go sámegiella ii goassege šatta mu vuosttašgiellan.

source: Det er ikke det at jeg ikke kan kommunisere lett på samisk, men norsk er det språket jeg kan best.
sme: Gulahalan gal njuovžilit sámegillii, muhto dárogiella lea aŋkke dat giella maid máhtán buoremusat.

source: Fra duodjiundervisninga ved Samisk høgskole: Elisabeth lager kartanker.
sme: Sámi allaskuvlla duodjeoahpahusas: Elisabeth duddjo kartáŋkkaid.

source: Fra en praksisperiode, der studentene lagde læremiddel som de brukte i undervisningen, en samisk stjernehimmel, som lyste opp i taket.
sme: Hárjehallamis, mas studeanttat ráhkadedje oahpponeavvuid maid geavahedje oahpaheamis. Dá lea sámi násteálbmi, maid čuvgejedje rohpái.

source: Studieåret i Manndalen
sme: Lohkanjahki Olmmáivákkis

source: Jeg kom fra folkehøgskole hvor jeg hadde bodd sammen med jevnaldrende, og så flytta jeg hjem for å bo hos mamma og pappa og studere samisk.
sme: Luohkás leimmet oktiigait su. guoktelot studeantta. Bohten álbmotallaskuvllas gos ledjen orron ovttas mu ahkásaččaiguin, ja de fárrejin siidii eatni ja áhči lusa sámegiela lohkat.

source: Det var litt av en overgang.
sme: Lei gal oalle nuppástus.

source: Men vi studerte jo i lag og hjalp hverandre, mamma og jeg.
sme: Muhto moai etniin logaime ovttas ja veahkeheimme nubbi nuppi.

source: Mamma kunne ordene og jeg kunne grammatikken.
sme: Eadni dat máhtii sániid ja mun ges máhtten giellaoahpa.

source: Vi gjorde lekser sammen og hadde hver våre sterke sider.
sme: Moai barggaime leavssuid ovttas, ja munnos ledje goabbame nana bealit.

source: Vi utfylte hverandre.
sme: Moai doarjaleimme goabbat guoibmáme.

source: Foreldrene mine var veldig positive til mitt valg.
sme: Váhnemiiddán leigga hui positiivvat mu válljemii.

source: De hadde nok vært positive uansett hva jeg hadde valgt, men jeg tror de synes det er litt artig at jeg har lært meg samisk.
sme: Livččiiga sihkkarit positiivvat vaikko maid livččen válljet, muhto jáhkán gal ahte sudno mielas lea binnáš suohtas ahte lean sámegiela oahppan.

source: Det er ikke mange fra Manndalen på min alder som har gjort det.
sme: Eai leat gal máŋga mu ahkásaš olmmáivággilačča dan dahkan.

source: Hva studietilbud eller mangel på det betyr
sme: Maid mearkkaša lohkanfálaldat?

source: Dette studiet som var i Manndalen, var en spesialordning som dessverre bare ble gjennomført én gang.
sme: Dát lohkanfálaldat mii čađahuvvui Olmmáivákkis, lei erenoamáš ortnet mii dađi bahábut čađahuvvui dušše dán oktii.

source: Det er nesten så man blir sur når man tenker på det.
sme: Olmmoš measta eardu go dan smiehttá.

source: Hvis ikke det tilbudet hadde blitt gjennomført, hadde Nord-Troms vært fattig på samisklærere nå.
sme: Jus dát fálaldat ii livčče čađahuvvon, eai livčče gal galle sámegieloahpaheaddji Davvi-Romssas dál.

source: Både jeg, Leif-Petter Eriksen, Idar Pedersen og Ruth Larsen som alle er samisklærere her på skolen, tok dette kurset.
sme: Sihke mun, Leif-Petter Eriksen, Idar Pedersen ja Ruth Larsen geat buohkat leat sámegielaoahpaheaddjit dán skuvllas, čuvvo justa dán kurssa.

source: Fire av skolens sju samisklærere kommer fra det kullet.
sme: Njealjis skuvlla čieža sámegieloahpaheddjis bohtet dán luohkás.

source: Og så tenker jeg på mange som har vært andrespråkselever her, som har tatt lærerutdanning i Tromsø.
sme: Ja de jurddašan máŋga iežá geat leat leamaš nubbingieloahppit dáppe, geat leat vázzán oahpaheaddjioahpu Romssas.

source: De har ikke fått samisk der.
sme: Eai sii leat doppe beassan sámegiela lohkat.

source: Nå er de kommet tilbake til Manndalen som lærere, og det er unge folk som kunne ha vært samisklærere.
sme: Dál leat máhccan Olmmáivággái oahpaheaddjin, nuorra olbmot geat sáhtáše leat sámegieloahpaheaddjit.

source: Det er surt å tenke på.
sme: Ii leat suohtas dan jurddašit.

source: Jeg håper ikke toget er gått for dem!
sme: Doaivvun ahte ain gávdnojit vejolašvuođat sidjiide!

source: Vi trenger så sårt flere samisklærere i vårt område.
sme: Mii duođaid dárbbašit eanet sámegieloahpaheddjiid min guovllus.

source: Hvis jeg har forstått rett, har sammenslåinga av lærerhøgskolen og universitetet gitt nye muligheter, så heretter kommer det kanskje nyutdannede lærere fra Tromsø med samisk i fagkretsen.
sme: Jus lean ipmirdan riekta, de lea oahpaheaddjiallaskuvlla ja universitehta ovttastahttin buktán ođđa vejolašvuođaid. Várra dán rájes boahtigohtet Romssas aiddooahppan oahpaheaddjit geat leat sámegiela lohkan oassin oahpahusas?

source: Men det tilbudet som vi fikk, burde ha vært arrangert flere ganger i Manndalen.
sme: Muhto dat fálaldat maid mii oaččuimet, dat galggašii leat čađahuvvon Olmmáivákkis eanet gerddiid.

source: Det hadde ikke trengt å være hvert år, men kanskje hvert tredje år.
sme: Ii livčče dárbbašan juohke jagi dan čađahit, muhto várra juohke goalmmát jagi.

source: Men ettersom jeg har forstått, var Samisk høgskole sitt mål at flest mulig skulle ta lærerutdanning.
sme: Muhto lean ipmirdan ahte lei Sámi allaskuvlla mihttomearri fidnet nu eatnagiid go vejolaš vázzit oahpaheaddjioahpu.

source: Nå var det bare to av oss som gikk det første året i Manndalen som gikk videre på lærerutdanninga.
sme: Leimme dušše guovttis Olmmáivággekurssas geat jotkkiime oahpaheaddjiohppui.

source: Så jeg tror at høgskolen ikke syntes det var verdt det.
sme: Danin jáhkán ahte allaskuvlla mielas ii lean dán veara.

source: Men i forhold til vår situasjon i Nord-Troms har det betydd mye.
sme: Muhto jus geahččá min dili Davvi-Romssas, de lea dát fálaldat leamaš hui dehálaš.

source: Det var jo mange som var lærere allerede, og som nå fikk samisk i sin fagkrets.
sme: Máŋggas geat dán vázze, ledje juo oahpaheaddjit, ja dál fidneje sámegiela fágan.

source: Jeg synes at Samisk høgskole har tenkt alt for snevert her.
sme: Mu mielas lea Sámi allaskuvla geahččan ášši menddo oktageardánit dás.

source: All undervisninga var på samisk også det første året i Manndalen.
sme: Gait oahpahus lei sámegillii maid vuosttaš jagi Olmmáivákkis.

source: Blant annet Elisabeth Utsi Gaup, Else Turi og Johanna Ijäs underviste.
sme: Earret iežá Elisabeth Utsi Gaup, Else Turi ja Johanna Ijäs oahpahedje.

source: Hvis man ikke forsto, så sa de det på andre måter.
sme: Jus studeanta ii ipmirdan, de sii čilgeje ášši iežáládje.

source: De ga seg ikke før man skjønte.
sme: Eai vuollánan ovdal go olmmoš ipmirdii.

source: Det var veldig dyktige lærere.
sme: Ledje hui čeahpes oahpaheaddjit.

source: Når jeg underviser, bruker jeg fortsatt en god del av metodene som Else Turi brukte overfor oss på semesteremnet.
sme: Go oahpahan, anán ain otná beaivve máŋga dain metodain maid Else Turi anii go oahpahii min lohkanbadjeoahpus.

source: Nå har jeg jobba i ti år, alle årene på samme skole.
sme: Dál lean bargan logi jagi, gait jagiid seammá skuvllas.

source: For eksempel Alit boazu, noen av dem har hatt samisk på skolen her.
sme: Lea hui suohtas oaidnit govt oahppit atnet sámegiela iešguđetge ládje, earret iežá Alit boazu.

source: De har jo blitt en kjent rockegruppe etterhvert, og de synger på samisk.
sme: Sii han lea šaddan dovddus rockejoavkun, ja sii lávlot sámegillii.

source: Samisk er jo en naturlig del av livet her i området.
sme: Sámegiella han leage lunddolaš oassi min eallimis dáppe min guovllus.

source: Det kan bety mye for den enkelte å lære litt samisk også.
sme: Sáhttá leat dehálaš eaŋkilolbmui oahppat binnás sámegiela maid.

source: Det er en identitetssak.
sme: Lea identitehttaášši.

source: Det at man ikke er helt fremmed for det samiske, er en verdi i seg selv.
sme: Lea iešalddis árvu ahte ii leat áibbas amas sámegillii.

source: Det å kunne litt samisk kan også komme til å bety mer for den enkelte når det har gått noen år.
sme: Dat ahte máhttit binnáš sámegiela sáhttá maid šaddat vel eanet dehálaš eaŋkilolbmui go leat moadde jagi vássán.

source: Når man stifter familie, for eksempel.
sme: Ovdamearkka dihtii go álggaha iežas bearraša.

source: For meg har samisk alltid vært et språk som er en del av min identitet.
sme: Munnje lea sámegiella álo leamaš giella mii lea mu identitehta oassin.

source: Jeg har alltid hørt samisk, selv om jeg ikke snakka og forsto det sjøl da jeg var yngre.
sme: Lean álo gullan sámegiela, vaikko in sárdnon in ge ipmirdan dan go ledjen nuorat.

source: Så da jeg begynte på videregående og Sametinget tilbød språkmotiveringsstipend, var det noe som bidro til at jeg valgte å lese samisk.
sme: Ja go de álgen joatkkaskuvlii ja Sámediggi fálai giellamovttiidahttinstipeandda, de dat váikkuhii dasa ahte álgen sámegiela lohkat.

source: Jeg hadde tysk fra før, men kunne ikke så mye.
sme: Ledjen ovdal lohkan duiskkagiela, muhto in máhttán nu olu.

source: Jeg fant ut at jeg like godt kunne starte fra med samisk.
sme: Gávnnahin ahte sáhtten seammá bures álgit álggu rájes sámegielain.

source: Jeg hadde større mulighet til å praktisere samisk enn tysk.
sme: Mus lei maid buoret vejolašvuohta hárjehallat sámegiela go duiskkagiela.

source: Og når man til og med får stipend for det – hva er vel bedre enn det?
sme: Ja go vel oažžu stipeandda dasa – mii vel buoret?

source: Jeg er ikke enig i at de som tar samisk som førstespråk skal få mest stipend.
sme: In leat ovttaoaivilis das ahte sii geat lohket sámegiela vuosttašgiellan galget oažžut eanemus stipeandda.

source: Hadde det ikke vært for at jeg tok samisk på lavere nivå, så hadde jeg ikke hatt grunnlaget for å lære samisk til det nivået jeg er på i dag.
sme: Jus mun in livčče sámegiela lohkan álgodásis, de ii livčče mus vuođđu oahppat sámegiela dan dássái maid dál lean oahppan.

source: Også de som tar samisk som fremmedspråk på videregående skole, kan bli språkbærere og språklærere.
sme: Sii geat lohket sámegiela amasgiellan joatkkaskuvllas, sáhttet maid šaddat giellaguoddin ja giellaoahpaheaddjin.

source: Og motiveringsstipend, det er jo for å motivere til å tilegne seg språket, uansett om du har det som første, andre eller fremmedspråk.
sme: Ja movttiidahttinstipeanda han lea dan várás ahte movttiidahttit giela oahppat, leaš go vuosttaš-, nubbin- vai amasgiellan.

source: Hvem er det som trenger den motivasjonen mest?
sme: Na, gii de dárbbaša dán movttiidahttima eanemusat?

source: Er det ikke det vi vil, at flest mulig skal lære og bruke språket?
sme: Ii go son leat dan maid háliidit, ahte nu máŋggas go vejolaš galget oahppat ja atnit giela?

source: Daværende rektor svarer
sme: Dalá rektor vástida
